app/Controllers/Food.php

SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '1'
AND `id_login` = '2'
 LIMIT 1
SELECT *
FROM `mesas`
WHERE `id_empresa` = '1'
---
    public function selecionarMesa()
    {
        // Verifica se tem permissão de acesso
        $permissao = $this->controle_de_acesso_model->verificaPermissao('novo_pedido');

        if ($url = $permissao):
            return redirect()->to($url);
        endif;

        $data['link'] = [
            'item' => '4.1'
        ];

        $data['titulo'] = [
            'modulo' => 'Selecionar Mesa',
            'icone' => 'fa fa-database',
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Selecionar Mesa", 'rota' => "", 'active' => true],
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $data['mesas'] = $this->mesa_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '1'
AND `id_login` = '2'
 LIMIT 1
SELECT *
FROM `mesas`
WHERE `id_empresa` = '1'
---
    public function mesas()
    {
        // Verifica se tem permissão de acesso
        $permissao = $this->controle_de_acesso_model->verificaPermissao('mesas');

        if ($url = $permissao):
            return redirect()->to($url);
        endif;

        $data['link'] = [
            'item' => '4.2'
        ];

        $data['titulo'] = [
            'modulo' => 'Mesas',
            'icone' => 'fa fa-database',
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Mesas", 'rota' => "", 'active' => true],
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $data['mesas'] = $this->mesa_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '1'
AND `id_login` = '2'
 LIMIT 1
SELECT *
FROM `mesas`
WHERE `id_empresa` = '1'
SELECT *
FROM `servicos`
WHERE `id_empresa` = '1'
SELECT *
FROM `configuracoes_do_painel`
WHERE `id_empresa` = '1'
 LIMIT 1
---
    public function configs()
    {
        // Verifica se tem permissão de acesso
        $permissao = $this->controle_de_acesso_model->verificaPermissao('configs');

        if ($url = $permissao):
            return redirect()->to($url);
        endif;

        $data['link'] = [
            'item' => '4.4'
        ];

        $data['titulo'] = [
            'modulo' => 'Configs',
            'icone' => 'fa fa-database',
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Configs", 'rota' => "", 'active' => true],
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $data['mesas'] = $this->mesa_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

        $data['servicos'] = $this->servico_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

        $data['config_painel'] = $this->configuracao_do_painel_model
                                        ->where('id_empresa', $this->id_empresa)
                                        ->first();