app/Controllers/Inicio.php

    public function index()
    {
        // Revifica se tem uma sessão ativa
        if($this->session->get('tipo') == null):
            $this->session->setFlashdata(
                'alert',
                [
                    'type' => 'error',
                    'title' => 'Você não está logado! Acesse sua conta para continuar.'
                ]
            );

            return redirect()->to('/login');
        endif;

        $data['link'] = [
            'item' => '1'
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                                    ->where('id_empresa', $this->id_empresa)
                                                    ->where('id_login', $this->id_login)
                                                    ->first();

        $mesas = $this->mesa_model
                            ->where('id_empresa', $this->id_empresa)
                            ->findAll();

        $produtos = $this->produto_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

        $entregas = $this->entrega_model
                            ->where('id_empresa', $this->id_empresa)
                            ->where('data >=', date("Y-m-01"))
                            ->where('data <=', date("Y-m-t"))
                            ->findAll();

        $lancamentos = $this->lancamento_model
                                    ->where('id_empresa', $this->id_empresa)
                                    ->findAll();
---
SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '1'
AND `id_login` = '3'
 LIMIT 1
SELECT *
FROM `mesas`
WHERE `id_empresa` = '1'
SELECT *
FROM `produtos`
WHERE `id_empresa` = '1'
SELECT *
FROM `entregas`
WHERE `id_empresa` = '1'
AND `data` >= '2026-04-01'
AND `data` <= '2026-04-30'
SELECT *
FROM `lancamentos`
WHERE `id_empresa` = '1'

        {
            $start_date = date('Y') . '-' . str_pad($i, 2, '0', STR_PAD_LEFT) . '-01';
            $end_date = date('Y-m-t', strtotime($start_date));
            $valor = $this->lancamento_model
                            ->where('id_empresa', $this->id_empresa)
                            ->where('data >=', $start_date)
                            ->where('data <=', $end_date)
                            ->selectSum('valor')
                            ->first();
---
SELECT SUM(`valor`) AS `valor`
FROM `lancamentos`
WHERE `id_empresa` = '1'
AND `data` >= '2026-01-01'
AND `data` <= '2026-01-31'
 LIMIT 1

        }

        // ------------------------ CONTAS A PAGAR E RECEBER DO MES ATUAL ------------------------- //
        $contas_pagar = $this->conta_pagar_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('data_de_vencimento >=', date('Y-m-01'))
                                            ->where('data_de_vencimento <=', date('Y-m-t'))
                                            ->findAll();

        $contas_receber = $this->conta_receber_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('data_de_vencimento >=', date('Y-m-01'))
                                            ->where('data_de_vencimento <=', date('Y-m-t'))
                                            ->findAll();

        $despesas = $this->despesa_model
                                    ->findAll();
---
SELECT *
FROM `contas_a_pagar`
WHERE `id_empresa` = '1'
AND `data_de_vencimento` >= '2026-04-01'
AND `data_de_vencimento` <= '2026-04-30'
SELECT *
FROM `contas_a_receber`
WHERE `id_empresa` = '1'
AND `data_de_vencimento` >= '2026-04-01'
AND `data_de_vencimento` <= '2026-04-30'
SELECT *
FROM `despesas`