app/Controllers/Login.php

SELECT *
FROM `login`
WHERE `usuario` = 'restaurante teste'
AND `senha` = '123'
 LIMIT 1
---
    public function autenticar()
    {
        $dados = $this->request->getvar();

        $login = $this->login_model
                    ->where('usuario', $dados['usuario'])
                    ->where('senha', $dados['senha'])
                    ->first();

SELECT `xFant`, `logomarca`
FROM `empresas`
WHERE `id_empresa` = '1'
 LIMIT 1
---

            elseif($login['tipo'] == 2) :

                $empresa = $this->empresa_model
                                ->where('id_empresa', $login['id_empresa'])
                                ->select('xFant, logomarca')
                                ->first();